#include <stdio.h>

int main() {
    int a[3] = {2, 7, 8};
    int *p;
    int j;
    p = a;//让指针变量p,指向数组的开头
    j = *p++; //后++,可以分为两步,第一步j=*p;p++,任何时候都是把后加加去掉,第二步另外一个运算符看优先级
    printf("a[0] = %d, j = %d , *p = %d\n", a[0], j, *p);
//a[0] = 2, j = 2 , *p = 7
    j = p[0]++;
    printf("a[0] = %d, j = %d , *p = %d\n", a[0], j, *p);
//2,2,3

//********************************
    j = (*p)++; //后++,可以分为两步,第一步j=*p;p++,任何时候都是把后加加去掉,第二步另外一个运算符看优先级
    printf("a[0] = %d, j = %d , *p = %d\n", a[0], j, *p);
//a[0] = 2,j = 2, *p = 3


    return 0;
}

